Обработки/Reports/_ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОстаткиДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНепройденныеСверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоСДвижениями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОстатка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиОстаткиЗаВычетомЗаблокированныхНаМНО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОстаткиДенежныхСредств/Forms/ФормаСохраненияРезультатовСверки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Параметры.Свойство("ПараметрыОтчета") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ПараметрыОтчета);	
	
	ЭтаФорма.ВремяСверки = ТекущаяДата();	
	
	// Получаем еще не сверенных клиентов
	
	Запрос = ПолучитьЗапросНесверенныхКлиентов(Параметры.ПараметрыОтчета.СчетаДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		ВыгрузкаЗапроса = РезультатЗапроса.Выгрузить().Скопировать(, "СчетДоверительногоУправления");
		ВыгрузкаЗапроса.Свернуть("СчетДоверительногоУправления");
		
		ВсеСчета.Загрузить(ВыгрузкаЗапроса);
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДобавитьТекущегоКлиентаВСверенные();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УбратьТекущегоКлиентаИзСверенных();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеСчетаПередУдалением(Элемент, Отказ)

	Отказ = Истина;	
	
	ДобавитьТекущегоКлиентаВСверенные();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеСчетаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	УбратьТекущегоКлиентаИзСверенных();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРезультатыСверки(Команда)

	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	КонецСледующегоРабочегоДня = КонецДня(РаботаСДокументами.СледующийРабочийДень(ЭтаФорма.ПериодСверки.ДатаНачала));	
	
	Если ЭтаФорма.ВремяСверки > КонецСледующегоРабочегоДня Тогда		
		Если Вопрос("Время сверки позже, чем следующий рабочий день после сверяемого дня. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СохранитьРезультатыСверки();
	
	ЭтаФорма.Закрыть(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьВСверенные(Команда)

	ДобавитьТекущегоКлиентаВСверенные();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьВСверенныеВсех(Команда)
	
	Для Каждого ТекущийСчет Из ВсеСчета Цикл
		ЗаполнитьЗначенияСвойств(ВыбранныеСчета.Добавить(), ТекущийСчет); 
	КонецЦикла;	
	
	ВсеСчета.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУбратьИзСверенных(Команда)

	УбратьТекущегоКлиентаИзСверенных();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУбратьИзСверенныхВсех(Команда)

	Для Каждого ТекущийСчет Из ВыбранныеСчета Цикл
		ЗаполнитьЗначенияСвойств(ВсеСчета.Добавить(), ТекущийСчет); 
	КонецЦикла;	
	
	ВыбранныеСчета.Очистить();		
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекущегоКлиентаВСверенные()
	
	ТекущиеДанные = Элементы.ВсеСчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ВыбранныеСчета.Добавить(), ТекущиеДанные); 
	
	ВсеСчета.Удалить(ВсеСчета.НайтиПоИдентификатору(Элементы.ВсеСчета.ТекущаяСтрока));	
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьТекущегоКлиентаИзСверенных()
	
	ТекущиеДанные = Элементы.ВыбранныеСчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ВсеСчета.Добавить(), ТекущиеДанные); 
	
	ВыбранныеСчета.Удалить(ВыбранныеСчета.НайтиПоИдентификатору(Элементы.ВыбранныеСчета.ТекущаяСтрока));	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыСверки()
	
	Запрос = ПолучитьЗапросНесверенныхКлиентов(ВыбранныеСчета.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		НачатьТранзакцию();	
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
		
			РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.ЗафиксироватьРезультатСверки(
				Организация,
				ВыборкаЗапроса.СчетДоверительногоУправления,
				ВыборкаЗапроса.ПериодСверки,
				Справочники.ВнешниеСистемы.СводныйОтчетОбОстаткахНаБанковскихСчетах,
				Истина,
				Истина,
				ВремяСверки
			);
			
		КонецЦикла;
	
		ЗафиксироватьТранзакцию();	
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапросНесверенныхКлиентов(ФильтрСчетовДУ)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СверяемыеКлиенты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СверяемыеКлиенты
		|ИЗ
		|	&СверяемыеКлиенты КАК СверяемыеКлиенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ДанныеКалендаря.ВидДня КАК ВидДня
		|ПОМЕСТИТЬ _ДниКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.Период КАК Период,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ _ОстаткиИОборотыДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногОУправления В
		|					(ВЫБРАТЬ
		|						_СверяемыеКлиенты.СчетДоверительногоУправления
		|					ИЗ
		|						_СверяемыеКлиенты)
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.Период,
		|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстатки.СуммаНачальныйОстаток,
		|	ОстаткиДенежныхСредствОстатки.СуммаКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногОУправления В
		|					(ВЫБРАТЬ
		|						_СверяемыеКлиенты.СчетДоверительногоУправления
		|					ИЗ
		|						_СверяемыеКлиенты)) КАК ОстаткиДенежныхСредствОстатки
		|ГДЕ
		|	ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваНаличные.Период,
		|	ДенежныеСредстваНаличные.СчетДоверительногоУправления,
		|	ДенежныеСредстваНаличные.СуммаНачальныйОстаток,
		|	ДенежныеСредстваНаличные.СуммаКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваНаличные.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногОУправления В
		|					(ВЫБРАТЬ
		|						_СверяемыеКлиенты.СчетДоверительногоУправления
		|					ИЗ
		|						_СверяемыеКлиенты)) КАК ДенежныеСредстваНаличные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваПереданныеВОплатуПаев.Период,
		|	ДенежныеСредстваПереданныеВОплатуПаев.СчетДоверительногоУправления,
		|	ДенежныеСредстваПереданныеВОплатуПаев.СуммаНачальныйОстаток,
		|	ДенежныеСредстваПереданныеВОплатуПаев.СуммаКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И СчетДоверительногОУправления В
		|					(ВЫБРАТЬ
		|						_СверяемыеКлиенты.СчетДоверительногоУправления
		|					ИЗ
		|						_СверяемыеКлиенты)) КАК ДенежныеСредстваПереданныеВОплатуПаев
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниСверокКлиентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|		_ДниКалендаря.Дата КАК Дата
		|	ИЗ
		|		Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СверяемыеКлиенты КАК _СверяемыеКлиенты
		|			ПО (_СверяемыеКлиенты.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДниКалендаря КАК _ДниКалендаря
		|			ПО (_ДниКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|				И СчетаДоверительногоУправления.ДатаЗаключения <= _ДниКалендаря.Дата
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > _ДниКалендаря.Дата)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ОстаткиИОборотыДенежныхСредств.СчетДоверительногоУправления,
		|		_ОстаткиИОборотыДенежныхСредств.Период
		|	ИЗ
		|		_ОстаткиИОборотыДенежныхСредств КАК _ОстаткиИОборотыДенежныхСредств
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СверяемыеКлиенты КАК _СверяемыеКлиенты
		|			ПО (_СверяемыеКлиенты.СчетДоверительногоУправления = _ОстаткиИОборотыДенежныхСредств.СчетДоверительногоУправления)
		|	ГДЕ
		|		_ОстаткиИОборотыДенежныхСредств.СуммаНачальныйОстаток <> _ОстаткиИОборотыДенежныхСредств.СуммаКонечныйОстаток) КАК СчетаДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниСверокКлиентов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДниСверокКлиентов.Дата КАК ПериодСверки
		|ИЗ
		|	_ДниСверокКлиентов КАК _ДниСверокКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСверокПоВнутреннемуУчету КАК ЖурналСверок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЖурналСверок.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|				ЖурналСверок.ПериодСверки КАК ПериодСверки,
		|				МАКСИМУМ(ЖурналСверок.Период) КАК Период
		|			ИЗ
		|				РегистрСведений.ЖурналСверокПоВнутреннемуУчету КАК ЖурналСверок
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДниСверокКлиентов КАК _ДниСверокКлиентов
		|					ПО (_ДниСверокКлиентов.СчетДоверительногоУправления = ЖурналСверок.СчетДоверительногоУправления)
		|						И (_ДниСверокКлиентов.Дата = ЖурналСверок.ПериодСверки)
		|			ГДЕ
		|				ЖурналСверок.Организация = &Организация
		|				И ЖурналСверок.Основание = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.СводныйОтчетОбОстаткахНаБанковскихСчетах)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ЖурналСверок.СчетДоверительногоУправления,
		|				ЖурналСверок.ПериодСверки) КАК ИзмененияЖурналаСверок
		|			ПО (ЖурналСверок.Организация = &Организация)
		|				И ЖурналСверок.СчетДоверительногоУправления = ИзмененияЖурналаСверок.СчетДоверительногоУправления
		|				И ЖурналСверок.ПериодСверки = ИзмененияЖурналаСверок.ПериодСверки
		|				И (ЖурналСверок.Основание = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.СводныйОтчетОбОстаткахНаБанковскихСчетах))
		|				И ЖурналСверок.Период = ИзмененияЖурналаСверок.Период
		|		ПО (ЖурналСверок.СчетДоверительногоУправления = _ДниСверокКлиентов.СчетДоверительногоУправления)
		|			И (ЖурналСверок.ПериодСверки = _ДниСверокКлиентов.Дата)
		|ГДЕ
		|	ЕСТЬNULL(ЖурналСверок.Пройдена, ЛОЖЬ) = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ДниСверокКлиентов.СчетДоверительногоУправления.Наименование,
		|	_ДниСверокКлиентов.Дата");	
	
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("НачалоПериода",		ПериодСверки.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",		ПериодСверки.ДатаОкончания);
	
	Если ТипЗнч(ФильтрСчетовДУ) = Тип("СписокЗначений") Тогда
		
		СверяемыеКлиенты = Новый ТаблицаЗначений;
		СверяемыеКлиенты.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
		
		Для Каждого ЭлементСписка Из ФильтрСчетовДУ Цикл
			Если Не ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			СчетДУ = СверяемыеКлиенты.Добавить();
			СчетДУ.СчетДоверительногоУправления = ЭлементСписка.Значение;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СверяемыеКлиенты", СверяемыеКлиенты);
		
	Иначе
		
		Запрос.УстановитьПараметр("СверяемыеКлиенты", ФильтрСчетовДУ);
		
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции
